In [1]:
import pandas as pd

Q1

.read_file_type: This is widely used to load a dataset of a type into the Local Development Environment.

.head(): It returns the first five rows of a dataset. It also takes a number as  a parameter and returns rows equivalent to number passed.

.tail(): It is similar to head but returns rows from the end of the dataset.

.describe(): It is used to get an statistical overview of Non categorical columns

.info(): It is used to get basic info about each column in the dataset.

In [3]:
df=pd.read_csv('datasets/Titanic-Dataset.csv')

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Q2

In [7]:
a=[1,2,3]
b=[4,5,6]
c=[7,8,9]
df2=pd.DataFrame({'A':a,'B':b,'C':c})
df2

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [8]:
df2.reindex([1,3,4])

     A    B    C
1  2.0  5.0  8.0
3  NaN  NaN  NaN
4  NaN  NaN  NaN

Q3

In [9]:
values=[10,20,30,40,50]
df3=pd.DataFrame({'Values':values})
df3

   Values
0      10
1      20
2      30
3      40
4      50

In [20]:
sum=0
for index,value in df3.iterrows():
    if index<3:
        sum+=int(value)
print(sum)

60

Q4

In [21]:
text=[input() for i in range(4) ]

In [23]:
df4=pd.DataFrame({'text':text})
df4

                 text
0      This is a text
1      My name is Sai
2      What about You
3  I like GeoPolitics

In [26]:
df4['word_count']=df4['text'].apply(lambda x: len(x.split()))
df4

                 text  word_count
0      This is a text           4
1      My name is Sai           4
2      What about You           3
3  I like GeoPolitics           3

Q5

In [29]:
df.size

10692

In [28]:
df.shape

(891, 12)

In [30]:
891*12

10692

.size(): It returns the product of rows and columns of a dataframe

.shape(): It returns a tuple containing the number of rows and columns of a dataframe

Q6

We use 
<strong>pd.read_excel </strong> 
or 
<strong>pd.read_xlsx </strong>

Q7

In [31]:
email=[input() for i in range(4) ]

In [33]:
df6=pd.DataFrame({'email':email})
df6

                  email
0         sai@gmail.com
1        dusa@gmail.com
2      Junaid@gmail.com
3  12.krishna@gmail.com

In [35]:
df6['username']=df6['email'].apply(lambda x : x.split('@')[0])
df6

                  email    username
0         sai@gmail.com         sai
1        dusa@gmail.com        dusa
2      Junaid@gmail.com      Junaid
3  12.krishna@gmail.com  12.krishna

Q8
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [36]:
b=[5,2,9,3,1]
a=[3,8,6,2,9]
c=[1,7,4,5,2]
df7=pd.DataFrame({'A':a,'B':b,'C':c})
df7

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [38]:
df7['A']>5

0    False
1     True
2     True
3    False
4     True
Name: A, dtype: bool

In [41]:
df7['B']<10

0    True
1    True
2    True
3    True
4    True
Name: B, dtype: bool

In [42]:
df7[(df7['A']>5) & (df7['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2